# Air Quality Data Set

In this notebook we will prepare and store the Air Quality Data Set from the [UCI Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Air+Quality)

**Citation:**

Dua, D. and Graff, C. (2019). [UCI Machine Learning Repository](http://archive.ics.uci.edu/ml). Irvine, CA: University of California, School of Information and Computer Science.


## Download and unzip the data

- Navigate to the [data folder](https://archive.ics.uci.edu/ml/machine-learning-databases/00360/).
- Download the zip file called **AirQualityUCI.zip**.
- Unzip it.
- Save the csv file called **AirQualityUCI.csv** into the **root** folder of this repository.

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# If you downloaded and stored the file as explained
# above, it should be located here:

filename = '../AirQualityUCI.csv'

In [3]:
# load the data

data = pd.read_csv(
    filename, sep=';', parse_dates=[['Date', 'Time']]
).iloc[:, :-2]  # drops last 2 columns, not real variables

# drop missing values
# these are added at the end of the file during reading
data.dropna(inplace=True)

data.shape

(9357, 14)

In [4]:
data.head()

,Date_Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
0,10/03/2004 18.00.00,"2,6",1360.0,150.0,"11,9",1046.0,166.0,1056.0,113.0,1692.0,1268.0,"13,6","48,9","0,7578"
1,10/03/2004 19.00.00,2,1292.0,112.0,"9,4",955.0,103.0,1174.0,92.0,1559.0,972.0,"13,3","47,7","0,7255"
2,10/03/2004 20.00.00,"2,2",1402.0,88.0,"9,0",939.0,131.0,1140.0,114.0,1555.0,1074.0,"11,9","54,0","0,7502"
3,10/03/2004 21.00.00,"2,2",1376.0,80.0,"9,2",948.0,172.0,1092.0,122.0,1584.0,1203.0,"11,0","60,0","0,7867"
4,10/03/2004 22.00.00,"1,6",1272.0,51.0,"6,5",836.0,131.0,1205.0,116.0,1490.0,1110.0,"11,2","59,6","0,7888"

In [5]:
data = data[["Date_Time", "PT08.S1(CO)"]]

data.columns = ['Date_Time', 'CO_sensor']

data.head()

             Date_Time  CO_sensor
0  10/03/2004 18.00.00     1360.0
1  10/03/2004 19.00.00     1292.0
2  10/03/2004 20.00.00     1402.0
3  10/03/2004 21.00.00     1376.0
4  10/03/2004 22.00.00     1272.0

In [6]:
data.dtypes

Date_Time     object
CO_sensor    float64
dtype: object

In [7]:
# cast date and time variable as datetime
# replace . by : to transform to datetime format

data['Date_Time'] = data['Date_Time'].str.replace('.', ':', regex=True)

data['Date_Time'] = pd.to_datetime(data['Date_Time'])

data.head()

            Date_Time  CO_sensor
0 2004-10-03 18:00:00     1360.0
1 2004-10-03 19:00:00     1292.0
2 2004-10-03 20:00:00     1402.0
3 2004-10-03 21:00:00     1376.0
4 2004-10-03 22:00:00     1272.0

In [8]:
# sort index
# we want the data in time order

data.sort_index(inplace=True)

In [9]:
# check the format

data.dtypes

Date_Time    datetime64[ns]
CO_sensor           float64
dtype: object

In [10]:
# sanity check: duplicates in dt variable

data['Date_Time'].duplicated().sum()

0

In [11]:
# check NA

data.isnull().sum()

Date_Time    0
CO_sensor    0
dtype: int64

In [12]:
# check time span

data['Date_Time'].agg(['min', 'max'])

min   2004-01-04 00:00:00
max   2005-12-03 23:00:00
Name: Date_Time, dtype: datetime64[ns]

In [13]:
# Reduce data span.
data = data[(
    data['Date_Time'] >= '2004-04-01') &
    (data['Date_Time'] <= '2005-04-30')
]

In [14]:
# Remove outliers
data = data.loc[(data['CO_sensor'] > 0)]

data.head()

            Date_Time  CO_sensor
0 2004-10-03 18:00:00     1360.0
1 2004-10-03 19:00:00     1292.0
2 2004-10-03 20:00:00     1402.0
3 2004-10-03 21:00:00     1376.0
4 2004-10-03 22:00:00     1272.0

In [15]:
# save preprocessed data

data.to_csv('../AirQualityUCI_ready.csv', index=False)